#+TITLE: A Small-Scale Example of Gerrymandering Analysis with MCMC
#+DATE:  June 29, 2018 
#+H: 3
#+OPTIONS: toc:nil

** An attempt at getting at the populations of each precinct

Legislative Districts in Sarpy County

| Leg Dist                             |      2 |         3 |      14 |        45 |        49 |           |
|--------------------------------------+--------+-----------+---------+-----------+-----------+-----------|
| Population                           |  38130 |     36801 |   37737 |     36862 |     37250 |     37356 |
| Number Precincts                     |      4 |        11 |      12 |        13 |        12 |      10.4 |
|--------------------------------------+--------+-----------+---------+-----------+-----------+-----------|
| Population / (Number Precincts)      | 9532.5 | 3345.5455 | 3144.75 | 2835.5385 | 3104.1667 | 3591.9231 |
|--------------------------------------+--------+-----------+---------+-----------+-----------+-----------|
| Average Popn per All 5 Dists         |        |           |         |           |           | 4392.5001 |
| Average Popn per Dists 3, 14, 45, 49 |        |           |         |           |           | 3107.5002 |
#+TBLFM: @3$7=52/5::@4=@2/@3::@5$7=vsum(@4$2..@4$6)/5::@6$7=vsum(@4$3..@4$6)/4

** Theoretical size of each congressional district

#+begin_src calc output:results
1826341/3
#+end_src

#+RESULTS:
: 608780.333333

** Average Population of each of 52 Sarpy Precincts

#+begin_src calc
158840/52
#+end_src

#+RESULTS:
: 3054.61538462

** Population of Sarpy County to Add to Douglas County to make Cong Dist 2

#+begin_src calc
617475 - 517110
#+end_src

#+RESULTS:
: 100365

** Number of Sarpy Precincts to Add to Douglas County to make Cong Dist 2

#+begin_src calc
100365/3054
#+end_src

#+RESULTS:
: 32.8634577603
Almost 33 precincts
In fact, 29 and 2 portions were added in 2011 redistricting, so call
it 30

** Another way to look at the number of Sarpy precincts to add 
to Douglas County to make Cong Dist 2

Let A = population of Congressional District 1 less Sarpy County 
      = Congresional District 1 population less 22 precincts
      = 616728 - 22 * 3055 = 549518

 #+begin_src calc
616728 - 22 * 3055
 #+end_src

 #+RESULTS:
 : 549518

Let B = population of Congressional District 2 less Sarpy County
      = population of Douglas County = 517110

Let n = number of Sarpy precincts to add to base of Cong Dist 1 to
make the full Cong District 1.
Let m = number of Sarpy precincts to add to Douglas County to make the
full Cong District 2.
Let P = average population of each precinct = 3055.

Then in principle should have A + n P = B + m P and m + n = 52.
That is, 

n + m = 52
P(n-m) = B -A

n+m = 52
n-m = (B-A)/P

so 
n = 26 + (B-A)/(2*P)
m = 26 - (B-A)/(2*P)

#+begin_src calc
26 + (517110 - 548518)/(2*3055)
26 - (517110 - 548518)/(2*3055)
#+end_src

#+RESULTS:
: 31.1404255319

So this calculation says add 31 precincts to Douglas County to make
Congressional District 2 (instead of the actually 29 plus 2 portions.)


** The percentage deviation between populations of CD 1 and 2
#+begin_src calc
(617475 - 616728)
#+end_src

#+RESULTS:
: 747

#+begin_src calc :results output
100 * ((617475 - 616728)/616728);
#+end_src

#+RESULTS:
: 0.121123088298
So the deviation is smaller than a precinct population.

** R code for the Markov Chain
#+begin_src R :session *R* :tangle sarpyMC.R
    library("graph")
    library("Rgraphviz")
    library("RBGL")

   getBoundary <- function(subgraph, graph) {
       bdy <- unique(unlist(graph::boundary(subgraph, graph)))
       return(bdy)
       ## returns  boundary of subgraph in graph as  R char vector
       ## in future, add some error checking for argument types
   }

   getSarpyPrecincts <- function(precList) {
       sarpyBoundary <- precList[!(precList %in% c("lanc", "doug"))]
       return(sarpyBoundary)
       ## returns list (char vector) of precincts stricly in Sarpy Cty
       ## in future, add some error checking for argument types
   }

  makeNewCongDist <-
      function(sarpyPrecincts, vertexDelete, vertexAdd, county) {
          newSarpyPrecincts <-
              c(sarpyPrecincts[-match(vertexDelete, sarpyPrecincts)],
                              vertexAdd, county)
       newCongDist <- graph::subGraph(newSarpyPrecincts, gSarpy)
       return(newCongDist)
       ## return a
   }

   vEccentricity <- function(graph, vertex) {
       ve <-  max(RBGL::dijkstra.sp(graph, start = vertex)$distances)
       return(ve)
       ## returns integer, longest shortest-path from vertex to
       ## every other vertex in graph        
       ## in future, add some error checking for argument types
   }

   gDiameter <- function(graph) {
       d <- max(RBGL::johnson.all.pairs.sp(graph))
       return(d)
       ## returns integer, greatest distance between any pair
       ## of vertices in  graph 
       ## in future, add some error checking for argument types
   }

   contiguous <- function(graph) {
       con <- length(RBGL::connectedComp(graph)) == 1
       return(con)
       ## returns logical (boolean), TRUE if single connected component
       ## in future, add some error checking for argument types
   }

  ## The following are compactness measures for the originally
  ## constituted congressional districts
  ## My goal is to have trial districts to have no
  ## greater eccentricities or diameters.
   BASEVECCENCD1 <- 7
   BASEGDIAMCD1 <- 7

   BASEVECCENCD2 <- 4
   BASEGDIAMCD2 <- 6

   sarpyAdj <- as.matrix(read.table("sarpy_adj.txt")) 
   #n x 2 edgelist matrix, not adjacency matrix!

   gSarpy <- ftM2graphNEL(sarpyAdj, edgemode = "undirected")

   cd1Prec <- c("lanc", "p1", "p2", "p3", "p4", "p5", "p6", "p7", "p8",
  "p9", "p10", "p11", "p12", "p13", "p16", "p17",  "p18", "p20", "p21",
  "p22",  "p24", "p25", "p26")
   cd2Prec <- setdiff(nodes(gSarpy), cd1Prec)
   congDist1 <- subGraph(cd1Prec, gSarpy)
   congDist2 <- subGraph(cd2Prec, gSarpy)

stepcounter <- 1
#+end_src

#+RESULTS:
: 1

#+begin_src R :session *R* :tangle sarpyMC.R
bdyCongDist1 <-
      getSarpyPrecincts(getBoundary(congDist1, gSarpy)) # in CongDist2
  bdyCongDist2 <-
      getSarpyPrecincts(getBoundary(congDist2, gSarpy)) # in CongDist1

   #randomly select a boundary precinct for each Congressional District
   precFromCongDist1 <- sample(bdyCongDist2, 1)
   precFromCongDist2 <- sample(bdyCongDist1, 1)

  ## something not working about here.....  Looks like the selected
  ## precinct doesn't get deleted.
  newCongDist1 <- makeNewCongDist(getSarpyPrecincts(cd1Prec),
                                  precFromCongDist1, precFromCongDist2,
                                  "lanc")
   newCongDist2 <- makeNewCongDist(getSarpyPrecincts(cd2Prec),
                                   precFromCongDist2, precFromCongDist1,
                                   "doug")

cat( vEccentricity(newCongDist1, "lanc"), gDiameter(newCongDist1), contiguous(newCongDist1), "\n")
cat( vEccentricity(newCongDist2, "doug"), gDiameter(newCongDist2), contiguous(newCongDist2), "\n")

   if (vEccentricity(newCongDist1, "lanc") <= BASEVECCENCD1 &&
       gDiameter(newCongDist1) <= BASEGDIAMCD1 &&
       contiguous(newCongDist1) &&
       vEccentricity(newCongDist2, "doug") <= BASEVECCENCD2 &&
       gDiameter(newCongDist2) <= BASEGDIAMCD2 &&
       contiguous(newCongDist2)
      ) {
       cat("Successful step", stepcounter, "\n")
       congDist1 <- newCongDist1
       congDist2 <- newCongDist2
       } else {
       cat("precinct exchange not successful")
       }

cat("step counter", stepcounter, "\n")
stepcounter <- stepcounter + 1
#+end_src

#+RESULTS:
: 11

